"""
HOW IT WORKS:

INITIAL DATA:

    NUMBER_TO_START_COUNTING_SENTENCES = 1

AND

    sentences_to_parce = [


        # first sentence
        (
            "hebrew_sentence_1",
            "translation_sentence_1",
        ),

        # second sentence
        (
            "hebrew_sentence_2",
            "translation_sentence_2",
        ),
    ]

RESULT:

    
        <record id="sentence_1" model="sentences">
            <field name="hebrew_sentence">hebrew_sentence_1</field>
            <field name="translation_sentence">translation_sentence_1</field>
            <field name="picture" type="base64" file="hebrew_learning/static/img/sentences/sentence_1.png"/>
            <field name="audio">hebrew_learning/static/audio/sentences/sentence_1.mp3</field>
        </record>

        
        <record id="sentence_2" model="sentences">
            <field name="hebrew_sentence">hebrew_sentence_2</field>
            <field name="translation_sentence">translation_sentence_2</field>
            <field name="picture" type="base64" file="hebrew_learning/static/img/sentences/sentence_2.png"/>
            <field name="audio">hebrew_learning/static/audio/sentences/sentence_2.mp3</field>
        </record>

"""

NUMBER_TO_START_COUNTING_SENTENCES = 1


def get_sentence_creation_record(sentences_list, NUMBER_TO_START_COUNTING_SENTENCES):
    sentences_creation_records = ""
    for sentence_data in sentences_list:
        sentences_creation_records += """
        <record id="sentence_{}" model="sentences">
            <field name="hebrew_sentence">{}</field>
            <field name="translation_sentence">{}</field>
            <field name="picture" type="base64" file="hebrew_learning/static/img/sentences/sentence_{}.png"/>
            <field name="audio">hebrew_learning/static/audio/sentences/sentence_{}.mp3</field>
        </record>

        """.format(
            # number in <record id="sentence_{}"...
            NUMBER_TO_START_COUNTING_SENTENCES,
            # hebrew_sentence
            sentence_data[0],
            # translation_sentence
            sentence_data[1],
            # number in <field name="picture" type="base64" file="hebrew_learning/static/img/sentences/sentence_{}.png"/>
            NUMBER_TO_START_COUNTING_SENTENCES,
            # number in <field name="audio">hebrew_learning/static/audio/sentences/sentence_{}.mp3</field>
            NUMBER_TO_START_COUNTING_SENTENCES
        )
        NUMBER_TO_START_COUNTING_SENTENCES += 1
        

    return sentences_creation_records

sentences_to_parce = [

    (
        "Привет всем!",
        "שלום לכולם",
    ),

    (
        "Давно не виделись!",
        "עבר זמן מאז שהתראינו",
    ),

    (
        "Приятно познакомиться!",
        "אני שמח לפגוש אותך",
    ),

    (
        "Увидимся завтра.",
        "נתראה מחר",
    ),

    (
        "Ты мне нравишся.",
        "אני מחבב אותך",
    ),

    (
        "Ты очень весёлый.",
        "אתה מצחיק יותר מידי",
    ),

    (
        "Ты классный.",
        "אתה מדהים",
    ),

    (
        "Ты очень красивая.",
        "את יפה מאוד",
    ),

    (
        "Ты очень красивый.",
        "אתה נראה טוב מאוד",
    ),

    (
        "Ты любишь меня?",
        "אתה אוהב אותי",
    ),

    (
        "Я тебя очень люблю.",
        "אני אוהב אותך מאוד",
    ),

    (
        "Я тебя не люблю.",
        "אני לא אוהב אותך",
    ),

    (
        "Я очень по тебе скучаю.",
        "אני מתגעגע אליך נורא",
    ),

    (
        "Разреши мне тебя обнять.",
        "תן חיבוק",
    ),

    (
        "Как тебя зовут?",
        "איך קוראים לך",
    ),

    (
        "Меня зовут …",
        "קוראים לי",
    ),

    (
        "Из какой ты страны?",
        "מאיזו מדינה אתה",
    ),

    (
        "Сколько тебе лет?",
        "בן כמה אתה בת כמה את",
    ),

    (
        "Сколько времени?",
        "מה השעה",
    ),

    (
        "Сегодня у меня нет времени чтобы …",
        "אין לי זמן היום ל",
    ),

    (
        "Завтра мой день рождения.",
        "מחר יום ההולדת שלי",
    ),

    (
        "Этот год я не хочу праздновать мой день рождения.",
        "השנה אני לא רוצה לחגוג את יום ההולדת שלי",
    ),

    (
        "С днём рождения!",
        "יום הולדת שמח",
    ),

    (
        "Хороших тебе выходных.",
        "סוף שבוע נעים",
    ),

    (
        "Хорошей тебе поездки (желаю хорошо съездить).",
        "טיול נעים",
    ),

    (
        "Что сегодня за день? (день недели / число в месяце)",
        "איזה יום היום",
    ),

    (
        "Я очень занят сегодня.",
        "היום אני עסוק מאוד",
    ),

    (
        "Что ты сегодня делал?",
        "מה עשית היום",
    ),

    (
        "Что ты будешь делать завтра?",
        "מה אתה עושה מחר",
    ),

    (
        "Что бы ты хотел делать завтра?",
        "מה אתה רוצה לעשות מחר",
    ),

    (
        "Завтра я хочу увидеться с моим отцом.",
        "מחר אני רוצה להיפגש עם אבא שלי",
    ),

    (
        "Что ты делал вчера?",
        "מה עשית אתמול",
    ),

    (
        "Не мог бы ты говорить немного медленнее?",
        "אתה יכול בבקשה לדבר לאט יותר",
    ),

    (
        "Не мог бы ты повторить это предложение?",
        "תוכל בבקשה לחזור על המשפט",
    ),

    (
        "Не мог бы ты это повторить?",
        "תוכל לחזור על זה בבקשה",
    ),

    (
        "Не мог бы ты это записать (написать)?",
        "תוכל לכתוב את זה",
    ),

    (
        "Не мог бы ты произнести это слово по буквам?",
        "תוכל לאיית לי את המילה",
    ),

    (
        "Не мог бы ты объяснить что значит это слово?",
        "תוכל להסביר לי מה המילה הזו אומרת",
    ),

    (
        "Я не расслышал это.",
        "לא שמעתי את זה",
    ),

    (
        "Что значит это (слово)?",
        "מה המשמעות של",
    ),

    (
        "Я не понимаю.",
        "אני לא מבין",
    ),

    (
        "Я не понимаю это выражение.",
        "אני לא מבין את הביטוי הזה",
    ),

    (
        "Я в порядке.",
        "אני בסדר",
    ),

    (
        "Я очень рад (счастлив).",
        "אני ממש שמח",
    ),

    (
        "Я очень устал.",
        "אני ממש עייף",
    ),

    (
        "Мне очень грустно.",
        "אני ממש עצוב",
    ),

    (
        "Я очень обеспокоен.",
        "אני מאוד מודאג",
    ),

    (
        "Я простудился.",
        "הצטננתי אני חולה",
    ),

    (
        "Я плохо себя чувствую.",
        "אני לא מרגיש טוב",
    ),

    (
        "Меня много чего волнует.",
        "יש לי הרבה דאגות על הראש",
    ),

    (
        "Не волнуйся!",
        "אל תדאג",
    ),

    (
        "Я хочу пить (жажда).",
        "אני צמא",
    ),

    (
        "Что бы ты хотел попить?",
        "מה אתה רוצה לשתות",
    ),

    (
        "Я хотел бы чашку кофе.",
        "אני רוצה כוס קפה בבקשה",
    ),

    (
        "Ты будешь (хочешь) пить чай?",
        "אתה רוצה לשתות תה",
    ),

    (
        "Что ты хотел бы поесть этим вечером?",
        "מה אתה רוצה לאכול הערב",
    ),

    (
        "Ты наелся (поел достаточно)?",
        "אחלת מספיק",
    ),

    (
        "Я сыт (полон), а ты?",
        "אני מלא ואת ואתה",
    ),

    (
        "Я голоден (очень).",
        "אני גווע",
    ),

    (
        "Я хочу есть.",
        "אני רוצה לאכול",
    ),

    (
        "Что бы ты хотел поесть?",
        "מה אתה רוצה לאכול",
    ),

    (
        "Я уже поел.",
        "אכלתי כבר",
    ),

    (
        "Я бы хотел поесть макароны.",
        "אני רוצה נודלס",
    ),

    (
        "Я бы хотел поесть супа.",
        "אני רוצה מרק",
    ),

    (
        "Я не голоден.",
        "אני לא רעב",
    ),

    (
        "У вас есть меню (дайте мне меню).",
        "יש תפריט",
    ),

    (
        "Официант, принесите мне меню.",
        "מלצר תוכל להביא לי את התפריט",
    ),

    (
        "Официант, счёт, пожалуйста.",
        "אפשר חשבון",
    ),

    (
        "Что вы рекомендуете?",
        "מה אתה ממליץ",
    ),

    (
        "Пожалуйста, звоните заранее, чтобы сделать бронь (зарезервировать место и т.д.).",
        "תתקשר מראש לעשות הזמנה",
    ),

    (
        "Что за погода сегодня?",
        "מה מזג האוויר היום",
    ),

    (
        "Будет сегодня дождь?",
        "יירד היום גשם",
    ),

    (
        "Сегодня очень жарко.",
        "היום חם מאוד",
    ),

    (
        "Сегодня солнечно (светит солнце).",
        "השמש זורחת היום",
    ),

    (
        "Сегодня очень хорошая погода.",
        "מזג האוויר טוב מאוד היום",
    ),

    (
        "Что бы ты хотел купить?",
        "מה אתה רוצה לקנות",
    ),

    (
        "Я бы хотел купить карту города.",
        "אני רוצה לקנות את מפת העיר",
    ),

    (
        "Я бы хотел купить пару обуви.",
        "אני רוצה לקנות זוג נעלים",
    ),

    (
        "Пожалуйста, покажите мне эту / этот / эти.",
        "אפשר לראות את זה בבקשה",
    ),

    (
        "Сколько (денег) за всё это вместе?",
        "כמה יוצא הכל יחד",
    ),

    (
        "Вау, это очень дорого!",
        "וואו זה יקר מאוד",
    ),

    (
        "У меня нет денег.",
        "אין לי כסף",
    ),

    (
        "Я потерял кошелёк.",
        "איבדתי את הארנק",
    ),

    (
        "Я бы хотел поменять доллары на евро.",
        "אני רוצה להמיר דולרים ביורו",
    ),

    (
        "Вчера я простудился.",
        "הצטננתי אתמול",
    ),

    (
        "Я простудился и кашлял всё утро.",
        "הצטננתי והשתעלתי כל הבוקר",
    ),

    (
        "Я болен, я чувствую себя очень нехорошо.",
        "אני חולה אני מרגיש ממש לא טוב",
    ),

    (
        "Я надеюсь, что скоро тебе станет лучше.",
        "אני מקווה שתרגיש טוב בקרוב",
    ),

    (
        "У тебя есть алергия на что-либо?",
        "אתה אלרגי למשהו",
    ),

    (
        "Что это?",
        "מה זה",
    ),

    (
        "Кто это?",
        "מי זה",
    ),

    (
        "Кто хозяин этой собаки?",
        "מי הבעלים של הכלב הזה",
    ),

    (
        "Что ты сделал?",
        "מה עשית",
    ),

    (
        "Где ты работаешь?",
        "איפה אתה עובד",
    ),

    (
        "Ты слишком много работаешь.",
        "אתה עובד יותר מידי",
    ),

    (
        "Откуда ты знаешь?",
        "איך אתה יודע",
    ),

    (
        "Куда ты ходил вчера вечером?",
        "לאן הלכת אתמול בערב",
    ),

    (
        "Пожалуйста, входите.",
        "בבקשה היכנס",
    ),

    (
        "Пожалуйста, закройте дверь.",
        "בבקשה סגור את הדלת",
    ),

    (
        "Пожалуйста, садитесь.",
        "שב בבקשה",
    ),

    (
        "Успокойтесь!",
        "הרגע",
    ),

    (
        "Пожалуйста, не шумите!",
        "תהיה בשקט",
    ),

    (
        "Не разговаривайте.",
        "אל תדבר",
    ),

    (
        "Пожалуйста, слушайте.",
        "הקשב בבקשה",
    ),

    (
        "Пожалуйста, не делайте так много шума.",
        "אל תעשה רעש בבקשה",
    ),

    (
        "Не плачь.",
        "תפסיק לבכות",
    ),

    (
        "Почему ты смеёшься?",
        "למה אתה צוחק",
    ),

    (
        "Пожалуйста, подожди меня немного, я буду через секунду.",
        "חכה לי רגע בבקשה אחזור עוד שניה",
    ),

    (
        "Давай отдохнём десять минут.",
        "בואו ניקח 10 דקות הפסקה",
    ),

    (
        "Пошли в кино.",
        "בואו נלך לסרט",
    ),

    (
        "Курение запрещено!",
        "העישון אסור",
    ),

    (
        "Пошли вместе.",
        "בואו נלך יחד",
    ),

    (
        "Пожалуйста, иди немного медленнее.",
        "לך בבקשה לאט יותר",
    ),

    (
        "Не трать время!",
        "אל תבזבז זמן",
    ),

    (
        "Когда ты вернёшь мои деньги?",
        "מתי תחזיר לי את הכסף",
    ),

    (
        "У меня есть идея.",
        "יש לי רעיון",
    ),

    (
        "Это очень хорошая идея.",
        "זה רעיון טוב מאוד",
    ),

    (
        "Это очень интересная тема.",
        "זה נושא מעניין מאוד",
    ),

    (
        "Какое у тебя мнение (о чём-либо)?",
        "מה דעתך",
    ),

    (
        "Я хочу узнать (услышать) твою точку зрения.",
        "אני רוצה לשמוע את דעתך",
    ),

    (
        "Я не понимаю что ты имеешь в виду.",
        "אני לא מבין למה אתה מתכוון",
    ),

    (
        "Ты согласен?",
        "אתה מסכים",
    ),

    (
        "Я не думаю, что я сделал что-либо не так (не правильно).",
        "אני לא חושב שעשיתי משהו רע",
    ),

    (
        "Ты прав!",
        "אתה צודק",
    ),

    (
        "Это действительно так.",
        "זה באמת כך",
    ),

    (
        "Я послал тебе текстовое сообщение.",
        "שלחתי לך הודעה",
    ),

    (
        "Какой у тебя номер телефона?",
        "מה מספר הטלפון שלך",
    ),

    (
        "Что случилось?",
        "מה קרה",
    ),

    (
        "Завтра я пришлю тебе E-mail.",
        "מחר אשלח לך מייל",
    ),

    (
        "Я забыл мой пароль.",
        "שכחתי את הסיסמה שלי",
    ),

    (
        "Я забыл твоё имя.",
        "שכחתי את שמך",
    ),

    (
        "Ты идиот.",
        "אתה מפגר",
    ),

    (
        "Как ты смеешь так говорить со мной?",
        "איך אתה מעז לדבר אלי ככה",
    ),

    (
        "Тебе нужна помощь?",
        "אתה צריך עזרה",
    ),

    (
        "Не мог бы ты мне помочь?",
        "אתה יכול לעזור לי",
    ),

    (
        "Пожалуйста, вы можете вызвать скорую? (Не могли бы вызвать скорую?)",
        "אתה יכול להתקשר לאמבולנס בבקשה",
    ),

    (
        "Извините, я не могу вам помочь.",
        "מצטער אני לא יכול לעזור לך",
    ),

    (
        "Где больница?",
        "איפה בית החולים",
    ),

    (
        "Куда ты идёшь?",
        "לאן אתה הולך",
    ),

    (
        "Мне нужно вернуться домой сейчас.",
        "אני חייב לחזור עכשיו הביתה",
    ),

    (
        "Как (какой дорогой) пройти к почтовому отделению?",
        "איך אני מגיע לדואר",
    ),

    (
        "Где ближайшая аптека?",
        "איפה בית המרקחת הקרוב",
    ),

    (
        "Это место занято? (Кто-то сидит на этом месте?)",
        "מישהו יושב פה",
    ),

    (
        "У меня есть вопрос.",
        "יש לי שאלה",
    ),

    (
        "Можно задать вопрос?",
        "אפשר לשאול אותך משהו",
    ),

    (
        "Я не знаю.",
        "אני לא יודע",
    ),

    (
        "Не важно. Проехали. Не обращай внимания.",
        "לא משנה",
    ),

    (
        "Пожалуйста скажите это ещё раз!",
        "תגיד את זה שוב בבקשה",
    ),

    (
        "Извините, что потревожил / отвлёк вас, продолжайте, пожалуйста.",
        "סליחה שהפרעתי לך בבקשה תמשיך",
    ),

    (
        "Что ты только что сказал?",
        "מה אמרת",
    ),

    (
        "Ты женат?",
        "אתה נשוי",
    ),

    (
        "У тебя есть девушка?",
        "יש לך חברה",
    ),

    (
        "У тебя есть парень?",
        "יש לך חבר",
    ),

    (
        "Ты где?",
        "איפה אתה",
    ),

    (
        "Мне нужно идти (мне пора).",
        "אני צריך ללכת",
    ),

    (
        "Не обращай внимание на то, что говорят другие.",
        "לא אכפת לי מה אחרים אומרים",
    ),

    (
        "Действительно, я ничего не могу сделать с этим.",
        "איני יכול לעשות דבר",
    ),

    (
        "В твоём предложении ошибка (оно не правильное).",
        "המשפט שלך לא נכון",
    ),

    (
        "Мне очень жаль.",
        "אני מאוד מצטער על כך",
    ),

    (
        "Во сколько ты встаёшь?",
        "מתי אתה מתעורר",
    ),

    (
        "Я просыпаюсь в восемь утра.",
        "אני מתעורר ב8בבוקר",
    ),

    (
        "Я встаю с кровати.",
        "אני קם מהמיטה",
    ),

    (
        "Ты завтракаешь?",
        "אתה אוכל ארוחת בוקר",
    ),

    (
        "Я чищу зубы.",
        "אני מצחצח שיניים",
    ),

    (
        "Я принимаю душ.",
        "אני מתקלח",
    ),

    (
        "Ты смотришь телевизор по утрам?",
        "אתה צופה בטלוויזיה בבוקר",
    ),

    (
        "Я проверяю (смотрю: что нового) телефон.",
        "אני בודק את הטלפון שלי",
    ),

    (
        "Я звоню моему начальнику.",
        "אני מתקשר לבוס שלי",
    ),

    (
        "Я проверяю электронную почту.",
        "אני בודק את האימיילים שלי",
    ),

    (
        "Ты водишь машину на работу?",
        "אתה נוהג לעבודה",
    ),

    (
        "Я еду на автобусе на работу.",
        "אני נוסע באוטובוס לעבודה",
    ),

    (
        "Мне нужно поставить будильник.",
        "אני צריך לכוון את השעון המעורר שלי",
    ),

    (
        "Я включаю свет.",
        "אני מדליק את האורות",
    ),

    (
        "Я выключаю свет.",
        "אני מכבה את האורות",
    ),

    (
        "Я делаю кофе утром.",
        "אני מכין קפה בבוקר",
    ),

    (
        "Ты выгуливаешь собаку?",
        "אתה לוקח את הכלב שלך לטיול",
    ),

    (
        "Я не смотрю новости.",
        "אני לא צופה בחדשות",
    ),

    (
        "Я мою лицо.",
        "אני שוטף את הפנים שלי",
    ),

    (
        "Мне нужно помыть руки.",
        "אני צריך לשטוף את הידיים שלי",
    ),

    (
        "Ты хочешь взять (купить) что-нибудь поесть?",
        "האם אתה רוצה ללכת לאכול משהו",
    ),

    (
        "Я застилаю кровать.",
        "אני מציע את מיטתי",
    ),

    (
        "Я надеваю обувь.",
        "אני מועל את נעליי",
    ),

    (
        "Ты выносишь мусор?",
        "האם אתה מוציא את הזבל",
    ),

    (
        "Ты моешь посуду?",
        "האם אתה שוטף את הכלים",
    ),

    (
        "Можешь открыть окно?",
        "אתה יכול לפתוח את החלון",
    ),

    (
        "Можешь закрыть окно?",
        "אתה יכול לסגור את הדלת",
    ),

    (
        "Во сколько открывается магазин?",
        "באיזו שעה נפתחת החנות",
    ),

    (
        "Во сколько закрывается ресторан?",
        "באיזו שעה נסגרת המסעדה",
    ),

    (
        "Ты смотришь видео в Ютубе?",
        "אתה צופה בסרטוני יוטיוב",
    ),

    (
        "Я расчёсываю волосы.",
        "אני מסתרק",
    ),

    (
        "Я иду на работу.",
        "אני הולך לעבודה",
    ),

    (
        "Я иду домой.",
        "אני הולך הביתה",
    ),

    (
        "Я иду в спортзал.",
        "אני הולך לחדר כושר",
    ),

    (
        "Я занимаюсь в спортзале.",
        "אני מתאמן בחדר הכושר",
    ),

    (
        "Мне нравится откладывать (копить) деньги.",
        "אני אוהב לחסוך כסף",
    ),

    (
        "Мне нужно идти наверх.",
        "אני צריך לעלות למעלה",
    ),

    (
        "Тебе нужно идти вниз.",
        "אתה צריך לרדת לקומה התחתונה",
    ),

    (
        "Мне нужно загрузить этот файл.",
        "אני צריך להוריד את הקובץ הזה",
    ),

    (
        "Скорость интернета низкая.",
        "מהירות האינטרנט איטית",
    ),

    (
        "Ты знаешь сколько времени?",
        "אתה יודע מה השעה",
    ),

    (
        "Я опаздываю.",
        "אני הולך לאחר",
    ),

    (
        "Я опаздал.",
        "אני מאחר",
    ),

    (
        "Мне нужно ждать в очереди.",
        "אני צריך לחכות בתור",
    ),

    (
        "Ты любишь слушать музыку?",
        "אתה אוהב להאזין למוזיקה",
    ),

    (
        "Пора идти.",
        "זה הזמן ללכת",
    ),

    (
        "Я делаю фотографии на телефоне.",
        "אני מצלם תמונות עם הנייד שלי",
    ),

    (
        "Я разбил чашку.",
        "שברתי את הכוס שלי",
    ),

    (
        "Я разлил кофе.",
        "שפכתי את הקפה שלי",
    ),

    (
        "Я люблю расплачиваться наличными.",
        "אני אוהב לשלם במזומן",
    ),

    (
        "Мне нравится платить кредитной карточкой.",
        "אני אוהב להשתמש בכרטיס האשראי שלי",
    ),

    (
        "Что ты заказал?",
        "מה הזמנת",
    ),

    (
        "Я заказал напиток.",
        "הזמנתי שתייה",
    ),

    (
        "Я ничего не заказывал.",
        "לא הזמנתי שום דבר",
    ),

    (
        "Можете принести мне стакан воды?",
        "אוכל לקבל כוס מים",
    ),

    (
        "Что ты делаешь?",
        "מה אתה עושה",
    ),

    (
        "Что ты планируешь делать завтра?",
        "מה אתה הולך לעשות מחר",
    ),

    (
        "У тебя есть планы на завтра?",
        "יש לך תוכניות למחר",
    ),

    (
        "Я открываю бутылку.",
        "אני פותח את הבקבוק",
    ),

    (
        "Мне нужно распечатать документ.",
        "אני צריך להדפיס מסמך",
    ),

    (
        "Мне нужно написать письмо.",
        "אני צריך לכתוב מכתב",
    ),

    (
        "Что на обед?",
        "מה יש לארוחת צהריים",
    ),

    (
        "Что на ужин?",
        "מה יש לארוחת ערב",
    ),

    (
        "Во сколько ты готовишь ужин?",
        "באיזו שעה אתה מכין ארוחת ערב",
    ),

    (
        "Я оплачиваю счета.",
        "אני משלם את החשבונות",
    ),

    (
        "Я усаживаюсь (сажусь).",
        "אני מתיישב",
    ),

    (
        "Я встаю.",
        "אני קם",
    ),

    (
        "Я иду (хожу) в школу.",
        "אני הולך לבית הספר",
    ),

    (
        "Я поднимаю руку.",
        "אני מרים את ידי",
    ),

    (
        "Я читаю книгу.",
        "אני קורא ספר",
    ),

    (
        "Я смотрю кино.",
        "אני צופה בסרט",
    ),

    (
        "Я иду в кинотеатр.",
        "אני הולך לקולנוע",
    ),

    (
        "Я бросил школу.",
        "עזבתי את בית הספר",
    ),

    (
        "Я принимаю ванну.",
        "אני עושה אמבטיה",
    ),

    (
        "Я умею кататься на велосипеде.",
        "אני יודע לרכב על אופניים",
    ),

    (
        "Я отдыхаю дома.",
        "אני נח בבית",
    ),

    (
        "Я отвечаю на комментарий.",
        "אני עונה לתגובה",
    ),

    (
        "Я арендую машину.",
        "אני שוכר מכונית",
    ),

    (
        "Я стираю.",
        "אני עושה כביסה",
    ),

    (
        "Я складываю одежду.",
        "אני מקפל את הבגדים",
    ),

    (
        "Я стираю одежду.",
        "אני שוטף את הבגדים",
    ),

    (
        "Я победил.",
        "ניצחתי",
    ),

    (
        "Я проиграл.",
        "הפסדתי",
    ),

    (
        "Я беру отпуск.",
        "אני יוצא לחופשה",
    ),

    (
        "Сколько ты зарабатываешь?",
        "כמה כסף אתה מרוויח",
    ),

    (
        "Я навожу порядок (убираюсь) в моей комнате.",
        "אני מסדר את החדר שלי",
    ),

    (
        "Я еду в лифте.",
        "אני משתמש במעלית",
    ),

    (
        "Я захожу (поднимаюсь) в автобус.",
        "אני עולה על האוטובוס",
    ),

    (
        "Я выхожу (спускаюсь) с поезда.",
        "אני יורד מהרכבת",
    ),

    (
        "Я пылесошу пол.",
        "אני שואב את הרצפה",
    ),

    (
        "Мне нравится отдыхать дома.",
        "אני אוהב להירגע בבית",
    ),

    (
        "Я хочу посмотреть кино.",
        "אני רוצה לצפות בסרט",
    ),

    (
        "Я внимателен в школе (в учёбе).",
        "אני מקשיב בלימודים",
    ),

    (
        "Какие у тебя хобби?",
        "מה התחביבים שלך",
    ),

    (
        "Я люблю бегать (спорт).",
        "אני אוהב לרוץ",
    ),

    (
        "Я люблю плавать.",
        "אני אוהב לשחות",
    ),

    (
        "Как тебя зовут?",
        "מה שמך",
    ),

    (
        "Меня зовут Джон (клавиша W для этого символа: ׳).",
        "שמי ג׳ון",
    ),

    (
        "Откуда ты?",
        "מאיפה אתה",
    ),

    (
        "Я из Колумбии.",
        "אני מקולומביה",
    ),

    (
        "Где ты это нашёл?",
        "איפה מצאת את זה",
    ),

    (
        "Я нашёл это в машине.",
        "מצאתי את זה במכונית",
    ),

    (
        "Ты где был?",
        "איפה היית",
    ),

    (
        "Я был дома.",
        "הייתי בבית",
    ),

    (
        "Куда ты идёшь?",
        "לאן אתה הולך",
    ),

    (
        "Я иду в отель.",
        "אני הולך למלון",
    ),

    (
        "Я иду домой.",
        "אני הולך הביתה",
    ),

    (
        "Где туалет?",
        "איפה השירותים",
    ),

    (
        "Это там.",
        "זה שם",
    ),

    (
        "Ты знаешь где банк?",
        "אתה יודע איפה נמצא הבנק",
    ),

    (
        "Где машина?",
        "איפה המכונית",
    ),

    (
        "Машина в гараже.",
        "המכונית נמצאת במוסך",
    ),

    (
        "Это моя кредитная карта.",
        "זה כרטיס האשראי שלי",
    ),

    (
        "Это мой кошелёк.",
        "זה הארנק שלי",
    ),

    (
        "Что ты делал вчера?",
        "מה עשית אתמול",
    ),

    (
        "Вчера я ходил в школу.",
        "אתמול הלכתי לבית ספר",
    ),

    (
        "Что ты будешь делать завтра?",
        "מה אתה הולך לעשות מחר",
    ),

    (
        "Завтра мне нужно рано на работу.",
        "מחר אני צריך לעבוד מוקדם",
    ),

    (
        "Как ты себя чувствуешь?",
        "איך אתה מרגיש",
    ),

    (
        "Я хорошо себя чувствую.",
        "אני מרגיש טוב",
    ),

    (
        "Как оно идёт (как дела)? ",
        "איך הולך",
    ),

    (
        "У меня всё хорошо. Спасибо.",
        "אני בסדר תודה",
    ),

    (
        "Не плохо.",
        "לא רע",
    ),

    (
        "У меня всё очень хорошо.",
        "אני בסדר גמור",
    ),

    (
        "Не хорошо (плохо).",
        "לא טוב",
    ),

    (
        "Увидимся позже.",
        "נתראה אחר כך",
    ),

    (
        "До скорой встречи.",
        "נתראה מאוחר יותר",
    ),

    (
        "И вы?",
        "ואתה",
    ),

    (
        "Чем был занят (что нового)?",
        "מה עשית לאחרונה",
    ),

    (
        "Мало чего (не много).",
        "לא הרבה",
    ),

    (
        "Я был очень занят.",
        "הייתי מאוד עסוק",
    ),

    (
        "Рад нашей встрече.",
        "נעים להכיר אותך",
    ),

    (
        "Увидимся завтра.",
        "נתראה מחר",
    ),

    (
        "Будь осторожен.",
        "שמור על עצמך",
    ),

    (
        "Нет.",
        "לא",
    ),

    (
        "Хорошо (согласен).",
        "טוב",
    ),

    (
        "Возможно (может быть).",
        "אולי",
    ),

    (
        "Извините меня.",
        "סלח לי",
    ),

    (
        "Не проблема.",
        "אין בעיה",
    ),

    (
        "Всё нормально (всё в прядке).",
        "הכל בסדר",
    ),

    (
        "Ты говоришь по-английски?",
        "האם אתה דובר אנגלית",
    ),

    (
        "Немножко.",
        "קצת",
    ),

    (
        "Я говорю по-английски.",
        "אני מדבר אנגלית",
    ),

    (
        "Мой английский не очень хороший.",
        "האנגלית שלי לא כל כך טובה",
    ),

    (
        "Я не знаю.",
        "אני לא יודע",
    ),

    (
        "Ты понимаешь?",
        "האם אתה מבין",
    ),

    (
        "Я понимаю.",
        "אני מבין",
    ),

    (
        "Я не понимаю.",
        "אני לא מבין",
    ),

    (
        "Ты можешь это повторить?",
        "תוכל לחזור על כך בבקשה",
    ),

    (
        "Не мог бы ты говорить помедленнее, пожалуйста.",
        "האם אתה יכול לדבר יותר לאט בבקשה",
    ),

    (
        "Пожалуйста, запишите это!",
        "בבקשה כתוב את זה",
    ),

    (
        "Как сказать “привет” на немецком?",
        "איך אתה אומר שלום בגרמנית",
    ),

    (
        "Ты где?",
        "היכן אתה",
    ),

    (
        "Я дома.",
        "אני בבית",
    ),

    (
        "Я на работе.",
        "אני בעבודה",
    ),

    (
        "Кем ты работаешь (как зарабатываешь на жизнь)?",
        "מה אתה עושה לפרנסתך",
    ),

    (
        "Я хочу учить английский.",
        "אני רוצה ללמוד אנגלית",
    ),

    (
        "Ты мог бы мне помочь?",
        "תוכל לעזור לי בבקשה",
    ),

    (
        "Я могу тебе помочь?",
        "אוכל לעזור לך",
    ),

    (
        "Я потерялся.",
        "הלכתי לאיבוד",
    ),

    (
        "Секундочку, пожалуйста.",
        "רגע אחד בבקשה",
    ),

    (
        "Сколько это стоит?",
        "כמה זה עולה",
    ),

    (
        "Как вас зовут?",
        "מה השם שלך",
    ),

    (
        "Как тебя зовут?",
        "איך קוראים לך",
    ),

    (
        "Откуда вы (страна)?",
        "מהיכן אתה",
    ),

    (
        "Откуда ты (страна)?",
        "מאיפה אתה",
    ),

    (
        "Кто ты по национальности?",
        "מה המוצא שלך",
    ),

    (
        "Где вы проживаете?",
        "היכן אתה מתגורר",
    ),

    (
        "Где ты живёшь?",
        "היכן אתה גר",
    ),

    (
        "Родился в Берлине.",
        "נולדתי בברלין",
    ),

    (
        "Я вырос в Германии.",
        "גדלתי בגרמניה",
    ),

    (
        "Какая сегодня погода?",
        "איך מזג האוויר היום",
    ),

    (
        "У тебя есть деньги?",
        "האם יש לך כסף",
    ),

    (
        "Сколько тебе лет?",
        "בן כמה אתה",
    ),

    (
        "Мне 30.",
        "אני בן 30",
    ),

    (
        "Какой у тебя адрес?",
        "מה הכתובת שלך",
    ),

    (
        "Какой у тебя номер телефона?",
        "מה מספר הטלפון שלך",
    ),

    (
        "Куда ты идёшь?",
        "לאן אתה הולך",
    ),

    (
        "Какой у тебя адрес электронной почты?",
        "מה כתובת הדואר האלקטרוני שלך",
    ),

    (
        "Удачи!",
        "בהצלחה",
    ),

    (
        "Хорошо сделано!",
        "עבודה טובה",
    ),

    (
        "Счастливого Рождества!",
        "חג מולד שמח",
    ),

    (
        "Счастливого дня рождения!",
        "יום הולדת שמח",
    ),

    (
        "За жизнь! (На здоровье!)",
        "לחיים",
    ),

    (
        "Поздравляю!",
        "ברכות",
    ),

    (
        "Будь здоров! (после чиха)",
        "לבריאות",
    ),

    (
        "Хорошей дороги!",
        "שתהיה לך נסיעה נעימה",
    ),

    (
        "Приятного аппетита.",
        "תהנה מהארוחה שלך",
    ),

    (
        "Я люблю тебя.",
        "אני אוהב אותך",
    ),

    (
        "Я тоже тебя люблю.",
        "אני אוהב אותך גם",
    ),

    (
        "Мне нужно идти (уйти) сейчас.",
        "אני חייב ללכת עכשיו",
    ),

    (
        "Это звучит хорошо! (Мне нравится!)",
        "זה נשמע טוב",
    ),

    (
        "Ты уверен?",
        "אתה בטוח",
    ),

    (
        "Я не уверен.",
        "אני לא בטוח",
    ),

    (
        "Не волнуйся об этом.",
        "אל תדאג בנוגע לזה",
    ),

    (
        "Можешь это объяснить?",
        "תוכל להסביר את זה",
    ),

    (
        "Я не знаю как это объяснить.",
        "אני לא יודע כיצד להסביר",
    ),

    (
        "Я не знаю как сказать это на английском.",
        "אני לא יודע איך להגיד את זה באנגלית",
    ),

    (
        "Например, …",
        "לדוגמא",
    ),

    (
        "Это вид животного.",
        "זה סוג של חיה",
    ),

    (
        "Можешь прочитать этот абзац?",
        "אתה יכול לקרוא את הפסקה הזאת",
    ),

    (
        "Можешь прочитать это слово?",
        "אתה יכול לקרוא את המילה הזאת",
    ),

    (
        "Я не знаю как использовать это слово.",
        "אני לא יודע כיצד להשתמש במילה הזאת",
    ),

    (
        "Как это (слово) произносится?",
        "כיצד אתה מבטא את זה",
    ),

    (
        "На сколько времени ты здесь?",
        "כמה זמן אתה נשאר כאן",
    ),

    (
        "Я буду здесь неделю.",
        "אני אהיה כאן במשך שבוע",
    ),

    (
        "Я здесь только один день.",
        "אני כאן רק ליום אחד",
    ),

    (
        "Когда ты уезжаешь?",
        "מתי אתה עוזב",
    ),

    (
        "Я уезжаю завтра.",
        "אני עוזב מחר",
    ),

    (
        "Почему ты здесь (цель нахождения здесь)?",
        "למה אתה כאן",
    ),

    (
        "Я здесь в отпуске.",
        "אני כאן לחופשה",
    ),

    (
        "Вот моя визитка.",
        "הנה הכרטיס הביקור שלי",
    ),

    (
        "Мне здесь нравится.",
        "אני אוהב להיות כאן",
    ),

    (
        "Что тебе здесь нравится?",
        "מה אתה אוהב כאן",
    ),

    (
        "Мне нравится погода (здешняя).",
        "אני אוהב את מזג האוויר",
    ),

    (
        "Мне нравятся люди (здесь).",
        "אני אוהב את האנשים",
    ),

    (
        "Мне нравится еда (здешняя).",
        "אני אוהב את האוכל",
    ),

    (
        "Будет дождь.",
        "הולך לרדת גשם",
    ),

    (
        "Как ты себя чувствуешь?",
        "איך אתה מרגיש",
    ),

    (
        "Я не здоров (болен).",
        "אני מרגיש חולה",
    ),

    (
        "Я хорошо себя чувствую (не болен).",
        "אני מרגיש טוב",
    ),

    (
        "Я устал.",
        "אני עייף",
    ),

    (
        "Мне грустно.",
        "אני עצוב",
    ),

    (
        "Я счастлив.",
        "אני שמח",
    ),

    (
        "Хочешь чего-нибудь поесть?",
        "האם אתה רוצה לאכול משהו",
    ),

    (
        "Что ты хочешь попить?",
        "מה אתה רוצה לשתות",
    ),

    (
        "Что-нибудь ещё?",
        "כל דבר אחר",
    ),

    (
        "Это всё (больше ничего).",
        "זה הכל",
    ),

    (
        "Можно это примерить?",
        "אפשר למדוד את זה",
    ),

    (
        "Можно мне карту (города)?",
        "אפשר לקבל מפה",
    ),

    (
        "Можно мне чек?",
        "אפשר לקבל את החשבון",
    ),

    (
        "Я бы хотел переехать в другую комнату.",
        "אני יכול לעבור לחדר אחר",
    ),

    (
        "Не мог бы я получить меню, пожалуйста.",
        "אפשר לקבל תפריט בבקשה",
    ),

    (
        "Не могли бы вы найми мне комнату для некурящих?",
        "אתה יכול למצוא לי חדר ללא עישון",
    ),

    (
        "Можете дать мне скидку?",
        "אתה יכול לתת לי הנחה",
    ),

    (
        "Не могли бы вы сфотографировать меня?",
        "אתה יכול לצלם אותי בבקשה",
    ),

    (
        "У вас есть рекомендации (можете что-то порекомендовать)?",
        "יש לך המלצות",
    ),

    (
        "Вы разговариваете по-английски.",
        "אתה מדבר אנגלית",
    ),

    (
        "Вы принимаете кредитные карты.",
        "אתם מקבלים כרטיסי אשראי",
    ),

    (
        "Извините, сколько стоит (какая плата, напр., за проезд)?",
        "סליחה כמה עולה נסיעה",
    ),

    (
        "Сколько это стоит?",
        "כמה זה עולה",
    ),

    (
        "У меня забронировано (номер в гостинице, стол в ресторане).",
        "הזמנתי מקום",
    ),

    (
        "Я бы хотел десять этих / таких.",
        "אני רוצה עשרה כאלה",
    ),

    (
        "Я бы хотел вот это.",
        "אני רוצה את זה",
    ),

    (
        "У меня алергия на арахис.",
        "אני אלרגי לבוטנים",
    ),

    (
        "Wi-Fi бесплатный?",
        "יש אינטרנט אלחוטי בחינם",
    ),

    (
        "Здесь есть автобус с аэропорта в город?",
        "יש אוטובוס משדה התעופה לעיר",
    ),

    (
        "Это правильный автобус в аэропорт?",
        "זה האוטובוס הנכון לשדה התעופה",
    ),

    (
        "Не подходит (не сидит по размеру).",
        "זה לא מתאים",
    ),

    (
        "Нашу еду ещё не принесли.",
        "האוכל שלנו עדיין לא הגיע",
    ),

    (
        "Это не то, что я заказал.",
        "זה לא מה שהזמנתי",
    ),

    (
        "Где вокзал (железнодорожная станция)?",
        "איפה תחנת הרכבת",
    ),
]

result = get_sentence_creation_record(
        sentences_to_parce,
        NUMBER_TO_START_COUNTING_SENTENCES
)

print(result)

